Examinator/src/Catalogs/СсылкиОбъектовСУЗ/СсылкиОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СсылкиОбъектовСУЗ</name>
  <owners>Catalog.СтраницыСУЗ</owners>
  <owners>Catalog.ВопросыСУЗ</owners>
  <owners>Catalog.СводыЗнанийСУЗ</owners>
  <owners>Catalog.РесурсыСУЗ</owners>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.ТерминыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦелевоеОкно</name>
    <type>
      <types>EnumRef.ЦелевыеОкнаДляСсылокСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементПодборки</name>
    <type>
      <types>CatalogRef.ЭлементыПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Якорь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/СсылкиОбъектовСУЗ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция АдресЦели(ЭлементСправочникаСсылки) Экспорт
	
	АдресЦели = "";
	
	Если ЗначениеЗаполнено(ЭлементСправочникаСсылки.СсылкаНаОбъектСУЗ) Тогда

		ДопСвойстваСсылки = Новый Структура();
		ДопСвойстваСсылки.Вставить("ЭлементПодборки", ЭлементСправочникаСсылки.ЭлементПодборки);
		ДопСвойстваСсылки.Вставить("ПривязатьКИдентификаторуЭлементаПодборки", Истина);
		
		АдресЦели = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(ЭлементСправочникаСсылки.СсылкаНаОбъектСУЗ, ЭлементСправочникаСсылки.ЦелевоеОкно, ЭлементСправочникаСсылки.Якорь, ДопСвойстваСсылки);

	Иначе

		АдресЦели = ЭлементСправочникаСсылки.ВнешняяСсылка;

		Если Найти(АдресЦели, "://") = 0 Тогда

			АдресЦели = ОбъектыСУзПовтИсп.АдресКаталогаОбъектов() + АдресЦели;
			АдресЦели = ОбщегоНазначенияСУКлиентСервер.ПривестиСлэши(АдресЦели);
			
		КонецЕсли;

	КонецЕсли;
	
	Возврат АдресЦели;
	
КонецФункции

Функция АдресСсылки(ЭлементСправочникаСсылки) Экспорт

	Если ЗначениеЗаполнено(ЭлементСправочникаСсылки) Тогда
		Возврат "?id=" + Строка(ЭлементСправочникаСсылки.УникальныйИдентификатор()) + "&action=openObjectLink";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
